{"id":"ab0c7aa0-7de4-11ec-b769-0560b1a07871","updated_at":"2022-03-09T09:43:16.563Z","updated_by":"james.spiteri@elastic.co","created_at":"2022-01-25T13:42:41.753Z","created_by":"james.spiteri@elastic.co","name":"Curl.exe Making external Network Connections","tags":["Elastic","Host","Windows","Threat Detection","Execution","auto_disabled_8.0"],"interval":"5m","enabled":true,"description":"Identifies curl.exe making a network connection. Adversaries could abuse curl.exe to download or execute malware from a remote URL.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m","kibana_siem_app_url":"https://ffa0e3abcb444c9ab93ffcefcbdb60a8.europe-west1.gcp.cloud.es.io/app/security"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Administrators may use the command prompt for regular administrative tasks. It's important to baseline your environment for network connections being made from the command prompt to determine any abnormal use of this tool."],"from":"now-540s","rule_id":"7ddf7730-5c60-4cef-8374-c14263733dbb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"reference":"https://attack.mitre.org/tactics/TA0002/","name":"Execution","id":"TA0002"},"technique":[{"reference":"https://attack.mitre.org/techniques/T1059/","name":"Command and Scripting Interpreter","id":"T1059","subtechnique":[]}]},{"framework":"MITRE ATT&CK","tactic":{"reference":"https://attack.mitre.org/tactics/TA0011/","name":"Command and Control","id":"TA0011"},"technique":[{"reference":"https://attack.mitre.org/techniques/T1105/","name":"Ingress Tool Transfer","id":"T1105","subtechnique":[]}]}],"to":"now","references":["https://www.iana.org/assignments/iana-ipv4-special-registry/iana-ipv4-special-registry.xhtml"],"version":13,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["logs-endpoint.events.*","logs-windows.*"],"query":"\n  network where process.name : \"curl.exe\" and event.action:\"disconnect_received\" and \n     not cidrmatch(destination.ip, \"10.0.0.0/8\", \"127.0.0.0/8\", \"169.254.0.0/16\", \"172.16.0.0/12\", \"192.0.0.0/24\",\n                                  \"192.0.0.0/29\", \"192.0.0.8/32\", \"192.0.0.9/32\", \"192.0.0.10/32\", \"192.0.0.170/32\",\n                                  \"192.0.0.171/32\", \"192.0.2.0/24\", \"192.31.196.0/24\", \"192.52.193.0/24\",\n                                  \"192.168.0.0/16\", \"192.88.99.0/24\", \"224.0.0.0/4\", \"100.64.0.0/10\", \"192.175.48.0/24\",\n                                  \"198.18.0.0/15\", \"198.51.100.0/24\", \"203.0.113.0/24\", \"240.0.0.0/4\", \"::1\",\n                                  \"FE80::/10\", \"FF00::/8\")\n","filters":[],"throttle":"rule","actions":[{"group":"default","id":"54c189d0-7de7-11ec-b009-c38b200b5574","params":{"body":"{\n\"name\":\"{{#context.alerts}}{{signal.rule.name}},{{/context.alerts}}\", \n\"hostname\":\"{{#context.alerts}}{{host.name}},{{/context.alerts}}\",\n\"username\":\"{{#context.alerts}}{{user.name}},{{/context.alerts}}\",\n\"command\":\"{{#context.alerts}}{{process.executable}},{{/context.alerts}}\",\n\"agent\":\"{{#context.alerts}}{{agent.id}},{{/context.alerts}}\",\n\"event_id\":\"{{#context.alerts}}{{_id}},{{/context.alerts}}\",\n\"source\":\"{{#context.alerts}}{{source.ip}},{{/context.alerts}}\",\n\"destination\":\"{{#context.alerts}}{{destination.ip}},{{/context.alerts}}\",\n\"destination_port\":\"{{#context.alerts}}{{destination.port}},{{/context.alerts}}\",\n\"alert_id\":\"{{alert.id}}\",\n\"index\":\"{{#context.alerts}}{{_index}},{{/context.alerts}}\",\n\"time\":\"{{date}}\",\n\"occurances\":\"{{state.signals_count}}\"\n}"},"action_type_id":".webhook"}]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
